app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("email", "type", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "test@test.fr"], ["type", "newsletter"], ["created_at", "2021-09-08 11:35:22.146162"], ["updated_at", "2021-09-08 11:35:22.146162"]]
---
  def create_newsletter
    @contact = Contact.new(contacts_params)
    unless @contact.contact_email == "foo-bar@example.com"
      if @contact.save

INSERT INTO "contacts" ("email", "contact_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "test@test.fr"], ["contact_type", "newsletter"], ["created_at", "2021-09-08 18:39:52.247071"], ["updated_at", "2021-09-08 18:39:52.247071"]]
---
  def create
    @contact = Contact.new(contacts_params)
    unless @contact.contact_email == "foo-bar@example.com"
      if @contact.save