app/controllers/helps_controller.rb

SELECT "helps".* FROM "helps" WHERE "helps"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @help = Help.find(params[:id])